In [51]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [77]:
np.random.seed(101)

In [78]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [79]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [80]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [81]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [85]:
df['new']=df['X']+df['Z']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266

In [89]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [91]:
df.drop('A')

          W         X         Y         Z       new
B  0.651118 -0.319318 -0.848077  0.605965  0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266

In [31]:
l=['1','kee',3]
m=np.array(l)
c=['a','b','c']
n={'a':100,'b':2}
print(m, n)

['1' 'kee' '3'] {'a': 100, 'b': 2}

In [45]:
series_arr=pd.Series(l,c)
series_arr[0]
series_arr+series_arr
series_arr

a      1
b    kee
c      3
dtype: object

In [12]:
pd.Series(n)

a    100
b      2
dtype: int64

In [49]:
d={'a':[1,2,3,4],'b':[1,2,np.nan,np.nan]}
df=pd.DataFrame(d)
df*df

    a    b
0   1  1.0
1   4  4.0
2   9  NaN
3  16  NaN

In [22]:
df.dropna(axis=0,thresh=2)

   a    b
0  1  1.0
1  2  2.0

In [24]:
df.fillna('Keerthana')

   a          b
0  1          1
1  2          2
2  3  Keerthana
3  4  Keerthana

In [26]:
dat={'btech':[1,2,3],
    'mtech':[0,0,0],
    'phd':[1,2,3]}

In [27]:
dat

{'btech': [1, 2, 3], 'mtech': [0, 0, 0], 'phd': [1, 2, 3]}

In [30]:
df= pd.DataFrame(dat)
df

   btech  mtech  phd
0      1      0    1
1      2      0    2
2      3      0    3

In [33]:
group_btech=df.groupby('btech')
group_btech.mean()

       mtech  phd
btech
1          0    1
2          0    2
3          0    3

In [34]:
group_btech.std()

       mtech  phd
btech
1        NaN  NaN
2        NaN  NaN
3        NaN  NaN

In [35]:
df.describe()

       btech  mtech  phd
count    3.0    3.0  3.0
mean     2.0    0.0  2.0
std      1.0    0.0  1.0
min      1.0    0.0  1.0
25%      1.5    0.0  1.5
50%      2.0    0.0  2.0
75%      2.5    0.0  2.5
max      3.0    0.0  3.0

In [43]:
import numpy as np
np.zeros([3,2])

array([[ 0.,  0.],
       [ 0.,  0.],
       [ 0.,  0.]])